#### Terraform Validation & Plan Results
* Terraform Version 📎`1.10.4`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_reader[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].time_rotating.rotating_current: Refreshing state... [id=2025-01-27T09:01:28Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_developer[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_network_connectivity_config.network_connectivity_config: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5/aa9121c0-b7d0-4fbc-aeff-ed5561b2d7ea][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_admin: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_developer[0]: Read complete after 2s [id=66271379238954][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_reader[0]: Read complete after 2s [id=439960392122911][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_admin: Read complete after 2s [id=408985471222074][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app_monitoring: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_storage: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_engineering: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_consumption: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_action_group.monitor_action_group: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/actionGroups/mydlz01-dptest-prd-ag001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.databricks_access_connector.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-dptest-prd-dbac001][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_engineering.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-eng-dbac001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_consumption.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-cnsmptn-dbac001][0m
[0m[1mmodule.data_landing_zone.module.platform.azapi_update_resource.virtual_network: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.azuread_service_principal.service_principal: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_admin: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_developer[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Read complete after 2s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/locations/northeurope][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.azuread_service_principal.service_principal: Read complete after 1s [id=/servicePrincipals/e73816f4-d36e-4271-8f9b-ad2752bdbfaf][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_reader[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal: Read complete after 2s [id=/servicePrincipals/e73816f4-d36e-4271-8f9b-ad2752bdbfaf][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_consumption_budget_subscription.consumption_budget_subscription: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Consumption/budgets/mydlz01-dptest-prd-bdgt][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/96ecbed0-8786-b218-c9af-2940cd6ad8e2][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_developer[0]: Read complete after 2s [id=/groups/fd3a6a34-8e7c-4315-803a-eedba0cc4b83][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_activity_log_alert.monitor_activity_log_alert_service_health: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/activityLogAlerts/mydlz01-dptest-prd-alert-servicehealth][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_admin: Read complete after 2s [id=/groups/f3776135-9227-43a1-a4bd-b786a82878fc][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_service_principal.service_principal: Refreshing state... [id=8089508589893950][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/02e7f7e6-8031-e533-1eba-55702975bae5][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_cognitive_services_usages_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Authorization/roleAssignments/d9c0097c-bb29-2b13-1423-81a844a5fc37][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/e3064aa9-94c9-ff82-ece2-62ae361ea079][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/4f4b95d9-3aa0-f026-aee2-93d58fafdd11][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Read complete after 2s [id=/servicePrincipals/7f7c7b4a-704d-4531-b73e-45e16b388271][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_officer_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/d99ae4a6-75d2-7963-f2be-0f203f39f00b][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/4edb2b7a-ddaa-5d8e-5112-abc3c513b661][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/a8882c0e-1c1f-28d1-3a5a-b9b0355ec014][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_user_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/989c904c-fb89-1158-1fa4-c6f5d118132e][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_reader[0]: Read complete after 2s [id=/groups/46a9f467-c63d-4a24-8de9-bb148135bec5][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_cognitive_services_usages_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Authorization/roleAssignments/81c9a93b-504c-9f33-9a9f-1e1f18b28f4f][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/e6ef5fd0-0d14-4e2b-083a-48fdd960b5ee][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/3e57ab4b-c6cf-c2dd-c346-5d60d8dbb7e0][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_officer_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/42e6dc38-74b4-d3d5-d844-df4ad2315316][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/944d686f-6276-18cb-a7b5-7e5700c1b3e7][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/697c3ca8-7c43-93b8-c55a-3ee96b5c6b0e][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/5b143c65-fce5-fa52-f92b-4f06e7b76016][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.databricksresourceprovider_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/3787c699-87f5-4135-a17a-5d61ae553e7e][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/8b97b59f-728f-6acb-be85-585303f9cac1][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/75ca38d1-b89c-c0ea-8107-41661a5f4fbd][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/98e636e9-4f8b-6795-9883-63cbb6935fb7][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dptest-prd-kv001-vault-pe][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dptest-prd-fore-kv001-account-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgraw-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/5442ae35-0fd3-7ac0-44b7-3b2452bfcf52][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_external_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/79a448c4-537e-fe3f-a7af-8b1cc2a71488][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/8b1f98f2-026f-4666-fac2-404f4e111b9c][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_enriched: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_raw: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_enriched_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/2f01f567-7b61-cc15-9b11-75faf255c4b3][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_external: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/e7d641de-a030-a86b-689a-afe4de10535f][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_curated_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/e53ebfa2-5e50-184d-28e6-dd1a4c4c8779][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_raw_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/39d520c8-835e-cc7a-da36-737ff73c3ab3][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_workspace_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/457afab1-b93d-cdfc-5a1f-f47785077246][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_curated: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/bb323f65-d3a8-2b86-d276-1a724cd494dd][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-dfs"]: Refreshing state... [id=aa9121c0-b7d0-4fbc-aeff-ed5561b2d7ea/7c188242-ef89-461c-b6c6-51d11448a743][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-blob"]: Refreshing state... [id=aa9121c0-b7d0-4fbc-aeff-ed5561b2d7ea/8ca19f77-16df-49f8-abf6-63fe4074bce6][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-dfs"]: Refreshing state... [id=aa9121c0-b7d0-4fbc-aeff-ed5561b2d7ea/b6e44ad7-6684-4fc4-8ac3-474d4dfdf1c5][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-blob"]: Refreshing state... [id=aa9121c0-b7d0-4fbc-aeff-ed5561b2d7ea/88bb0597-c97c-484b-9f15-66c1bff7fd5c][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-blob"]: Refreshing state... [id=aa9121c0-b7d0-4fbc-aeff-ed5561b2d7ea/8b3693fe-20cf-4fcd-9590-4b7969019247][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-dfs"]: Refreshing state... [id=aa9121c0-b7d0-4fbc-aeff-ed5561b2d7ea/3ea73f74-ccbf-44b5-8756-a45c3aa41b4e][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-dfs"]: Refreshing state... [id=aa9121c0-b7d0-4fbc-aeff-ed5561b2d7ea/93713154-2a13-4651-a9eb-044069b3340c][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-dfs"]: Refreshing state... [id=aa9121c0-b7d0-4fbc-aeff-ed5561b2d7ea/67169d19-4d9d-45c4-a579-e5f183d6cb65][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-blob"]: Refreshing state... [id=aa9121c0-b7d0-4fbc-aeff-ed5561b2d7ea/23097f33-308c-433e-b3ec-617b777a2016][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-blob"]: Refreshing state... [id=aa9121c0-b7d0-4fbc-aeff-ed5561b2d7ea/830a90df-d528-46f8-a9a8-eb3e2c96ef56][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-27T09:04:46Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-27T09:03:30Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_enriched_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/4d83136f-22d3-dbb8-c404-6f58bcdad77d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/b9308e82-2867-6802-8d5b-94f13fd43763][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/bc5984f4-e3f1-d749-9e67-856e4c9a9c97][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/9d1d0782-f00c-1878-9c4a-cbc5249b206a][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/e00042b5-60e6-c3a3-f881-500839e9920d][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-27T09:07:17Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/1b29beb8-c237-e483-dac5-b2272e3c435c][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/e38aa345-8a70-d02f-0b1a-fa5719eb16a5][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/0cbf433b-3ef3-1d95-8187-10652eec5e81][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_raw_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/4a6c5d2e-7a30-2460-fc44-625ef9cf0424][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/dc8f8970-e7f5-4aa5-96d0-efc8ee718938][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/65626c32-dc11-d3a7-c698-58249cafab70][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/a40ee646-864a-0c6d-c239-d1baf9440975][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_external_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/a9300786-9f2f-a488-403a-cb9b181ba34e][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/d1b1964d-2c28-44d9-9240-209bd4b6c804][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/5fd19070-029a-11e7-2c25-767364546e36][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/60769486-0545-f98e-1205-db80af550104][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_workspace_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/5d7f11cb-7dac-eabd-de20-2280bd93640c][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/f28a5e2f-d110-5357-b887-7d8393e5eaba][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/802d083d-0896-bf58-172a-87b8f3e41fd8][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/631d0ca2-965d-28fd-e777-e3ff1cef7308][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-27T09:05:45Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/0317efae-97b1-e6fb-5c42-c4a49da4ba48][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_curated_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/7ab1fb86-6097-5268-1cf9-e336fa0ddfe8][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/9089e208-c327-cb0b-fbcc-d3e576f7099d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/de8a79e7-9bea-7a0f-76b2-a9545deee8ac][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/a8d9d6ce-fe4c-d44f-1b1a-37237a5c24a4][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-27T09:06:29Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-blob"]: Refreshing state... [id=3892414980980427291][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-blob"]: Refreshing state... [id=4436011086060274577][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-dfs"]: Refreshing state... [id=6844609810326147590][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-dfs"]: Refreshing state... [id=1684729653656786278][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-blob"]: Refreshing state... [id=6343042068498010915][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-dfs"]: Refreshing state... [id=481754131708167947][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-blob"]: Refreshing state... [id=7281314115473084720][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-dfs"]: Refreshing state... [id=3606550364911111295][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-blob"]: Refreshing state... [id=3431123525009641825][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-dfs"]: Refreshing state... [id=7997044657704988145][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-27T09:04:51Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_service_principal["fore"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001/providers/Microsoft.Authorization/roleAssignments/14ad194a-587a-cbd5-4324-9f71e398ae81][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_admin["fore"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001/providers/Microsoft.Authorization/roleAssignments/b0f38d2a-e301-c47c-5558-05d925b821ca][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_developer["fore"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001/providers/Microsoft.Authorization/roleAssignments/a73b6c5f-696d-2f05-2e0b-5c38da01edc4][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-27T09:09:06Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-27T09:09:17Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/4c8267ad-13d2-5e70-f7ce-764095de8fd7][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/57c7bfa3-f01e-d076-899c-6270389f5179][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/e4ac6ba2-91d2-9dfa-4e0b-08f527836f52][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_binding.ncc_binding["engineering"]: Refreshing state... [id=2784538346365727/aa9121c0-b7d0-4fbc-aeff-ed5561b2d7ea][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/cb4ee19b-fc42-466c-52e2-4f7c493d0c46][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_binding.ncc_binding["consumption"]: Refreshing state... [id=1203957267893957/aa9121c0-b7d0-4fbc-aeff-ed5561b2d7ea][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_budget.budget[0]: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5|570f2fcc-0a75-4616-8b3e-da4438e57ef1][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_reader[0]: Refreshing state... [id=439960392122911][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["serving"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|serving][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["marketplace"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|marketplace][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["billing"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|billing][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["compute"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|compute][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["access"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|access][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["storage"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|storage][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["query"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|query][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["lakeflow"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|lakeflow][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_cluster_policy.cluster_policy["DltComputePolicyPtt"]: Refreshing state... [id=00187E8CC8507407][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_directory.directory: Refreshing state... [id=/mydlz01-dptest-int][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_cluster_policy.cluster_policy["JobComputePolicyPtt"]: Refreshing state... [id=00158979B6369622][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_cluster_policy.cluster_policy["PersonalComputePolicyPtt"]: Refreshing state... [id=0004AFBD6E8B0A8C][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_secret_scope.secret_scope: Refreshing state... [id=mydlz01-dptest-int-secret-scope][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_storage_credential.storage_credential: Refreshing state... [id=mydlz01-dptest-int-stg-cred][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_credential.credential: Refreshing state... [id=mydlz01-dptest-int-cred][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_credential_service_principal: Refreshing state... [id=credential/mydlz01-dptest-int-cred/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_credential_admin: Refreshing state... [id=credential/mydlz01-dptest-int-cred/app001-admin][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_workspace_binding.workspace_binding_credential: Refreshing state... [id=2784538346365727|credential|mydlz01-dptest-int-cred][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_credential_reader[0]: Refreshing state... [id=credential/mydlz01-dptest-int-cred/app001-reader][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_credential_developer[0]: Refreshing state... [id=credential/mydlz01-dptest-int-cred/app001-developer][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_workspace_binding.workspace_binding_storage_credential: Refreshing state... [id=2784538346365727|storage_credential|mydlz01-dptest-int-stg-cred][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_storage_credential_reader[0]: Refreshing state... [id=storage_credential/mydlz01-dptest-int-stg-cred/app001-reader][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_landing_zone.module.databricks_core.databricks_workspace_conf.workspace_conf[0m will be created
[0m  [32m+[0m[0m resource "databricks_workspace_conf" "workspace_conf" {
      [32m+[0m[0m custom_config = {
          [32m+[0m[0m "customerApprovedWSLoginExpirationTime"            = "1998-01-01T00:00:00.000Z"
          [32m+[0m[0m "enableDatabricksAutologgingAdminConf"             = "true"
          [32m+[0m[0m "enableDbfsFileBrowser"                            = "false"
          [32m+[0m[0m "enableDeprecatedClusterNamedInitScripts"          = "false"
          [32m+[0m[0m "enableDeprecatedGlobalInitScripts"                = "false"
          [32m+[0m[0m "enableExportNotebook"                             = "false"
          [32m+[0m[0m "enableFileStoreEndpoint"                          = "false"
          [32m+[0m[0m "enableIpAccessLists"                              = "true"
          [32m+[0m[0m "enableJobsEmailsV2"                               = "true"
          [32m+[0m[0m "enableNotebookTableClipboard"                     = "false"
          [32m+[0m[0m "enableProjectsAllowList"                          = "true"
          [32m+[0m[0m "enableResultsDownloading"                         = "false"
          [32m+[0m[0m "enableTokensConfig"                               = "false"
          [32m+[0m[0m "enableUploadDataUis"                              = "false"
          [32m+[0m[0m "enableVerboseAuditLogs"                           = "true"
          [32m+[0m[0m "enableWebTerminal"                                = "true"
          [32m+[0m[0m "enforceUserIsolation"                             = "true"
          [32m+[0m[0m "maxTokenLifetimeDays"                             = "1"
          [32m+[0m[0m "mlflowRunArtifactDownloadEnabled"                 = "false"
          [32m+[0m[0m "projectsAllowList"                                = "https://github.com/"
          [32m+[0m[0m "projectsAllowListPermissions"                     = "ALLOWLISTED_CLONE_COMMIT_PUSH"
          [32m+[0m[0m "reposIpynbResultsExportPermissions"               = "DISABLE"
          [32m+[0m[0m "storeInteractiveNotebookResultsInCustomerAccount" = "true"
        }
      [32m+[0m[0m id            = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_catalog.catalog_external[0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "catalog_external" {
      [32m+[0m[0m comment                        = "Data Applicaton Catalog - dptest - External"
      [32m+[0m[0m enable_predictive_optimization = "DISABLE"
      [32m+[0m[0m force_destroy                  = true
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m isolation_mode                 = "OPEN"
      [32m+[0m[0m metastore_id                   = (known after apply)
      [32m+[0m[0m name                           = "mydlz01-dptest-int"
      [32m+[0m[0m owner                          = (known after apply)
      [32m+[0m[0m properties                     = {
          [32m+[0m[0m "app_name"    = "dptest"
          [32m+[0m[0m "costCenter"  = "ABCD1234"
          [32m+[0m[0m "environment" = "int"
          [32m+[0m[0m "location"    = "northeurope"
          [32m+[0m[0m "use"         = "external"
        }
      [32m+[0m[0m storage_root                   = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_catalog.catalog_internal[0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "catalog_internal" {
      [32m+[0m[0m comment                        = "Data Applicaton Catalog - dptest - Internal"
      [32m+[0m[0m enable_predictive_optimization = "DISABLE"
      [32m+[0m[0m force_destroy                  = true
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m isolation_mode                 = "ISOLATED"
      [32m+[0m[0m metastore_id                   = (known after apply)
      [32m+[0m[0m name                           = "mydlz01-dptest-int-int"
      [32m+[0m[0m owner                          = (known after apply)
      [32m+[0m[0m properties                     = {
          [32m+[0m[0m "app_name"    = "dptest"
          [32m+[0m[0m "costCenter"  = "ABCD1234"
          [32m+[0m[0m "environment" = "int"
          [32m+[0m[0m "location"    = "northeurope"
          [32m+[0m[0m "use"         = "internal"
        }
      [32m+[0m[0m storage_root                   = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_curated[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_curated" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default curated storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-stg-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-cur"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_enriched[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_enriched" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default enriched storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-stg-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-enr"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-enr@mydlz01coreintstgenr.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_external[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_external" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default external storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-stg-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-ext"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-ext@mydlz01coreintstgext.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_raw[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_raw" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default raw storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-stg-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-raw"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-raw@mydlz01coreintstgraw.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_workspace[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_workspace" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default workspace storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-stg-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-wks"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-wks@mydlz01coreintstgwks.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_external_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_admin" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-admin"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_external_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_developer" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-developer"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_external_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_reader" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-reader"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_external_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_service_principal" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_internal_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_admin" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-admin"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_internal_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_developer" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-developer"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_internal_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_reader" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-reader"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_internal_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_service_principal" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_curated_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_curated_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_curated_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_curated_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_enriched_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_enriched_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_enriched_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_enriched_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_external_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_external_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_external_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_external_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_raw_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_raw_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_raw_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_raw_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_workspace_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_workspace_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_workspace_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_workspace_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_storage_credential_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_storage_credential_admin" {
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m principal          = "app001-admin"
      [32m+[0m[0m privileges         = [
          [32m+[0m[0m "CREATE EXTERNAL LOCATION",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
      [32m+[0m[0m storage_credential = "mydlz01-dptest-int-stg-cred"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_storage_credential_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_storage_credential_developer" {
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m principal          = "app001-developer"
      [32m+[0m[0m privileges         = [
          [32m+[0m[0m "CREATE EXTERNAL LOCATION",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
      [32m+[0m[0m storage_credential = "mydlz01-dptest-int-stg-cred"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_storage_credential_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_storage_credential_service_principal" {
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m principal          = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges         = [
          [32m+[0m[0m "CREATE EXTERNAL LOCATION",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
      [32m+[0m[0m storage_credential = "mydlz01-dptest-int-stg-cred"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_permission_assignment" "permission_assignment_admin" {
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m permissions  = [
          [32m+[0m[0m "USER",
        ]
      [32m+[0m[0m principal_id = 408985471222074
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_permission_assignment" "permission_assignment_developer" {
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m permissions  = [
          [32m+[0m[0m "USER",
        ]
      [32m+[0m[0m principal_id = 66271379238954
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_permission_assignment" "permission_assignment_service_principal" {
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m permissions  = [
          [32m+[0m[0m "USER",
        ]
      [32m+[0m[0m principal_id = 8089508589893950
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_cluster_policy["DltComputePolicyPtt"][0m will be created
[0m  [32m+[0m[0m resource "databricks_permissions" "permissions_cluster_policy" {
      [32m+[0m[0m cluster_policy_id = "00187E8CC8507407"
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m object_type       = (known after apply)

      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_USE"
          [32m+[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-admin"
          [32m+[0m[0m permission_level       = "CAN_USE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_cluster_policy["JobComputePolicyPtt"][0m will be created
[0m  [32m+[0m[0m resource "databricks_permissions" "permissions_cluster_policy" {
      [32m+[0m[0m cluster_policy_id = "00158979B6369622"
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m object_type       = (known after apply)

      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_USE"
          [32m+[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-admin"
          [32m+[0m[0m permission_level       = "CAN_USE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_cluster_policy["PersonalComputePolicyPtt"][0m will be created
[0m  [32m+[0m[0m resource "databricks_permissions" "permissions_cluster_policy" {
      [32m+[0m[0m cluster_policy_id = "0004AFBD6E8B0A8C"
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m object_type       = (known after apply)

      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_USE"
          [32m+[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-admin"
          [32m+[0m[0m permission_level       = "CAN_USE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_directory[0m will be created
[0m  [32m+[0m[0m resource "databricks_permissions" "permissions_directory" {
      [32m+[0m[0m directory_path = "/mydlz01-dptest-int"
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m object_type    = (known after apply)

      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_MANAGE"
          [32m+[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-admin"
          [32m+[0m[0m permission_level       = "CAN_MANAGE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-developer"
          [32m+[0m[0m permission_level       = "CAN_MANAGE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-reader"
          [32m+[0m[0m permission_level       = "CAN_READ"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_secret_acl.secret_acl_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_acl" "secret_acl_admin" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m permission = "READ"
      [32m+[0m[0m principal  = "app001-admin"
      [32m+[0m[0m scope      = "mydlz01-dptest-int-secret-scope"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_secret_acl.secret_acl_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_acl" "secret_acl_developer" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m permission = "READ"
      [32m+[0m[0m principal  = "app001-developer"
      [32m+[0m[0m scope      = "mydlz01-dptest-int-secret-scope"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_secret_acl.secret_acl_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_acl" "secret_acl_service_principal" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m permission = "READ"
      [32m+[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m scope      = "mydlz01-dptest-int-secret-scope"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_workspace_binding.external_location_curated[0m will be created
[0m  [32m+[0m[0m resource "databricks_workspace_binding" "external_location_curated" {
      [32m+[0m[0m binding_type   = "BINDING_TYPE_READ_WRITE"
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m securable_name = (known after apply)
      [32m+[0m[0m securable_type = "external_location"
      [32m+[0m[0m workspace_id   = 2784538346365727
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_workspace_binding.workspace_binding_catalog_internal[0m will be created
[0m  [32m+[0m[0m resource "databricks_workspace_binding" "workspace_binding_catalog_internal" {
      [32m+[0m[0m binding_type   = "BINDING_TYPE_READ_WRITE"
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m securable_name = "mydlz01-dptest-int-int"
      [32m+[0m[0m securable_type = "catalog"
      [32m+[0m[0m workspace_id   = 2784538346365727
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_workspace_binding.workspace_binding_external_location_enriched[0m will be created
[0m  [32m+[0m[0m resource "databricks_workspace_binding" "workspace_binding_external_location_enriched" {
      [32m+[0m[0m binding_type   = "BINDING_TYPE_READ_WRITE"
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m securable_name = (known after apply)
      [32m+[0m[0m securable_type = "external_location"
      [32m+[0m[0m workspace_id   = 2784538346365727
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_workspace_binding.workspace_binding_external_location_external[0m will be created
[0m  [32m+[0m[0m resource "databricks_workspace_binding" "workspace_binding_external_location_external" {
      [32m+[0m[0m binding_type   = "BINDING_TYPE_READ_WRITE"
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m securable_name = (known after apply)
      [32m+[0m[0m securable_type = "external_location"
      [32m+[0m[0m workspace_id   = 2784538346365727
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_workspace_binding.workspace_binding_external_location_raw[0m will be created
[0m  [32m+[0m[0m resource "databricks_workspace_binding" "workspace_binding_external_location_raw" {
      [32m+[0m[0m binding_type   = "BINDING_TYPE_READ_WRITE"
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m securable_name = (known after apply)
      [32m+[0m[0m securable_type = "external_location"
      [32m+[0m[0m workspace_id   = 2784538346365727
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_workspace_binding.workspace_binding_external_location_workspace[0m will be created
[0m  [32m+[0m[0m resource "databricks_workspace_binding" "workspace_binding_external_location_workspace" {
      [32m+[0m[0m binding_type   = "BINDING_TYPE_READ_WRITE"
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m securable_name = (known after apply)
      [32m+[0m[0m securable_type = "external_location"
      [32m+[0m[0m workspace_id   = 2784538346365727
    }

[1m  # module.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["dfs"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydlz01coreintstgraw-dfs-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydlz01coreintstgraw-dfs-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydlz01-core-int-storage-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/StorageSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydlz01coreintstgraw-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydlz01coreintstgraw-dfs-svc"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "dfs",
            ]
        }
    }

[1m  # module.data_landing_zone.module.core.module.storage_account_raw.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "20s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001"
    }

[1m  # module.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
      [33m~[0m[0m access_policy                   = [
          [31m-[0m[0m {
              [31m-[0m[0m certificate_permissions = []
              [31m-[0m[0m key_permissions         = []
              [31m-[0m[0m object_id               = "7f7c7b4a-704d-4531-b73e-45e16b388271"
              [31m-[0m[0m secret_permissions      = [
                  [31m-[0m[0m "Get",
                  [31m-[0m[0m "List",
                ]
              [31m-[0m[0m storage_permissions     = []
              [31m-[0m[0m tenant_id               = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ]
        id                              = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001"
        name                            = "mydlz01-dptest-prd-kv001"
        tags                            = {
            "costCenter" = "ABCD1234"
        }
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1mPlan:[0m 57 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>